---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartDiameterInOption
source: html/b633e0ef-7a5b-2362-3684-9ad41bd2bbda.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartDiameterInOption Property

"Main Primary Diameter Option"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartDiameterInOption { get; }
```